#+TITLE: Plan** TODO 1.3 stocks @24h** TODO 1.3 stocks @24h

- [X] complete plan
- [X] add estimates

- *TOTATL:* 54 (/ 54 4)


* 1. POC runs =EST=sum:19= 
** DONE BTC @ 5m simple
** DONE BTC @ 5m multi-feature
** TODO BTC @ 5m + day of week
** DONE BTC @ 24h =EST=sum:2=
*** DONE get it working
*** DONE improve seq_len ~EST:1~
*** DONE targets =EST:1= ~22:50-~
** DONE BTC @ 24h multi-feature =EST:1=
** DONE BTC @ 24h + trend derived from SP500 =EST=sum:2=
*** trend: lr slope (trend_feature_1) and R2 (trend_feature_2)
*** DONE code to add trend feature =EST:1=
*** DONE !!! figure out how to normalize trend feature
*** DONE tune to see if better results can be obtained with extra features =EST:1=
    CLOCK: [2018-09-22 Sat 19:30]--[2018-09-22 Sat 20:01] =>  0:31
** TODO BTC related companies + BTC trend as extra feature =EST=sum:4=
*** TODO basic mode =EST:1=
    CLOCK: [2018-09-22 Sat 20:02]--[2018-09-22 Sat 20:53] =>  0:51
*** TODO code to add extra features =EST:1=
    CLOCK: [2018-09-22 Sat 20:53]--[2018-09-22 Sat 21:19] =>  0:26
*** TODO tune model =EST:2=
    CLOCK: [2018-09-23 Sun 14:33]--[2018-09-23 Sun 15:52] =>  1:19
    CLOCK: [2018-09-23 Sun 11:16]--[2018-09-23 Sun 14:28] =>  3:12
** TODO review alternative models =ET=sum:10=
*** DONE triple-LR =EST=sum:6=
**** DONE confirm sanity =EST:1=
**** DONE possibly replace with something more sane =EST:3=
**** DONE try to run and possibly fix =EST:1=
**** DONE standardize code =EST:1=
*** TODO ARIMA =EST=sum:4=
**** TODO review basic principles =EST:1=
**** TODO try to run and possibly fix =EST:2=
**** TODO standardize code =EST:1=
  
* 2. Full runs =EST=sum:15=
- [ ] BTC @ 5m =EST=sum:6=
  - [ ] simple =EST:2=
  - [ ] multi-feature =EST:2=
  - [ ] multi-feature + day of week =EST:2=
- [ ] BTC @ 24h =EST:3=
  - [ ] simple =EST:1=
  - [ ] multi-features =EST:1=
  - [ ] multi-features + trend derived from SP500 =EST:1=
- [ ] BTC related companies =EST:6=
  - [ ] simple =EST:2=
  - [ ] multi-feature =EST:2=
  - [ ] with BTC trend as extra feature =EST:2=


* 3. Write text =EST=sum:8=
- [ ] plan =EST:1=
- [ ] write =EST:4=
- [ ] figures =EST:2=
- [ ] fine tune =EST:1=

* 4. Update text to match full runs =EST=4=

* 5. Proofread text and final format =EST=4=

* 6. Code and data cleanup =EST=4=
